doc/paper/sweetjs.tex
% Created 2014-03-03 Mon 19:55
\documentclass[preprint,10pt]{sigplanconf}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{amsmath}
\usepackage{amsthm}
\usepackage{stmaryrd}
\usepackage{amssymb}
\usepackage{gastex}
\usepackage{graphics}
\usepackage{listings}
\usepackage{microtype}
\input{brackets}
\input{definitions}
\authorinfo{Tim Disney}{UC Santa Cruz}{}
\authorinfo{Nate Faubion}{}{}
\authorinfo{David Herman}{Mozilla}{}
\renewcommand{\author}[1]{}
\author{Tim Disney}
\date{\today}
\title{Sweet.js - Hygienic Macros for JavaScript}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Sweet.js - Macros for JavaScript},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.5h)}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec-1}

Sweet.js is a new hygienic macro system for JavaScript.

Macros systems have a long history in the design of extensible
programming languages going back at least to lisp as a tool to provide
programmers syntactic flexibility.

While powerful macro systems have been used extensively in lisp
derived languages there has been considerable less movement for macros
systems for languages with an expression based syntax such as
JavaScript. This is due to a variety of technical reasons that have
held back macro systems in expression based languages which we address
in this paper.

Recently the Honu project has shown how to overcome some of the
existing challenges in developing a macro system for expression based
language. The Honu technique was designed for an idealized JavaScript
like language. In this paper we show how to extend the ideas of Honu
for full JavaScript and present additional techniques that target
expression based languages.

The design of sweet.js attempts to overcome the following technical
challenges: 

\begin{itemize}
\item a correct implementation of \texttt{read} that structures the token stream
before expansion begins
\item parser class annotation (e.g. \texttt{:expr}) in patterns to allow macro
authors easier declaration of a macro shape
\item operator overloading
\item infix macros
\item the \texttt{invoke} primitive to allow custom parser classes and more
powerful matching
\end{itemize}

\section{Overview}
\label{sec-2}
TODO: syntax, main features etc\ldots

\section{Read}
\label{sec-3}

The syntax of JavaScript presents a challenge to correctly implement
the critical \texttt{read} function. This challenge is not present in Honu
because their language is an idealized syntax that misses the
problematic interaction of delimiters and regular expression literals.

TODO: motivate \texttt{read} with examples etc.

\subsection{Proof of \texttt{read}}
\label{sec-3-1}

\begin{displayfigure}{\label{fig:grammar}Simplified JS Grammar}
\[
  \begin{array}{rrl}
    \textit{Literal }&::=& num ~|~ str ~|~ /regex/ \\
    \\
    \textit{Expr }&::=& \textit{Literal }\\
    &|& \textit{Expr}~ +~\textit{Expr }\\
    &|& \textit{Expr}~/~\textit{Expr }\\
  \end{array}
\]
\end{displayfigure}

The grammar of a simplified version of JavaScript is defined in Figure
\ref{fig:grammar}. While this grammar does not cover the entirety of
JavaScript, we claim it captures the essential complexity of \texttt{read}
for JavaScript (TODO: maybe complete(ish?) grammar/proof in the appendix?).
The function \texttt{read} is defined in Figure \ref{fig:read}.

TODO: extend grammar/proof to cover at least calls, if statements, and
blocks.

To prove that \texttt{read} correctly distinguishes between the divide
operator and a regular expression literal we first extend the grammar
to carry a prefix:

\[
\begin{array}{rrl}
  \textit{Expr}_{p} &::=& \textit{Literal}
  \\
  &|& \textit{Expr}_{p}~+~\textit{Expr}_{+~p}
  \\
  &|& \textit{Expr}_{p}~/~\textit{Expr}_{/~p}
\end{array}
\]

Then "something something by induction" QED.


\begin{displayfigure*}{\label{fig:read}Read Algorithm}
  
\[
\begin{array}{rcl}
  \texttt{Token} &::=& \textit{num}~|~\textit{str}~|~+~|~/ \\
\end{array}
\]

  \texttt{read} :: \verb![Token] -> [ReadTree] -> [ReadTree]!
\[
  \begin{array}{lcl}
    \readfn{[\num,~\ldots \textrm{rest}]}{\textrm{prefix}}
    &=&
    \cons{\num}{
      \readfn{\textrm{rest}}{
        \cons{\num}{\textrm{prefix}} 
      }
    }
    \\
    \readfn{[\str,~\ldots \textrm{rest}]}{\textrm{prefix}}
    &=&
    \cons{\str}{
      \readfn{\textrm{rest}}{
        \cons{\str}{\textrm{prefix}}
      }  
    }
    
    
    \\
    \readfn{[+,~\ldots \textrm{rest}]}{\textrm{prefix}}
    &=&
    \cons{+}{
      \readfn{\textrm{rest}}{
        \cons{+}{\textrm{prefix}}
      }
    } 
    \\
    \readfn{[/,~\ldots \textrm{rest}]}{[\num,~\ldots\textrm{prefix}]}
    &=&
    \cons{/}{
      \readfn{\textrm{rest}}{
        \cons{/,~\num}{\textrm{prefix}} 
      }
    }
    \\
    \readfn{[/,~\ldots \textrm{rest}]}{[\str,~\ldots\textrm{prefix}]}
    &=&
    \cons{/}{
      \readfn{\textrm{rest}}{
        \cons{/,~\str}{\textrm{prefix}} 
      }
    }
    \\
    \readfn{[/,~\ldots \textrm{rest}]}{[\textit{regex},~\ldots\textrm{prefix}]}
    &=&
    \cons{/}{
      \readfn{\textrm{rest}}{
        \cons{/,~\textit{regex}}{\textrm{prefix}} 
      }
    }
    \\
    \readfn{[/,~\ldots \textrm{rest}]}{[+,~\ldots\textrm{prefix}]}
    &=&
    \cons{\textit{regex}}{
      \readfn{\textrm{regexRest}}{
        \cons{\textit{regex},~+}{\textrm{prefix}} 
      }
    }
    \\
    && \textit{where}~(\textit{regex},~\textrm{regexRest}) = 
    \textrm{scanRegex}(\textrm{rest})
    \\
    \readfn{[/,~\ldots \textrm{rest}]}{[/,~\ldots\textrm{prefix}]}
    &=&
    \cons{\textit{regex}}{
      \readfn{\textrm{regexRest}}{
        \cons{\textit{regex},~/}{\textrm{prefix}} 
      }
    }
    \\
    && \textit{where}~(\textit{regex},~\textrm{regexRest}) = 
    \textrm{scanRegex}(\textrm{rest})
  \end{array}
\]
\end{displayfigure*}

\section{Enforestation}
\label{sec-4}

The core algorithm introduced by Honu is called \emph{enforestation} which
is basically responsible for expanding macros and building a partial
syntax tree with enough structure to match on parse classes. Sweet.js
implements this algorithm mostly as described with some additions to
provide infix macros and invoke pattern classes described below.

\subsection{Infix Macros}
\label{sec-4-1}
The macros we have described so far must all be prefixed by the macro
identifier and syntax after the macro name is matched. This is
sufficient for many kinds of macros but some syntax forms require the
macro identifier to sit between patterns.

Honu addresses this need in a limited way by providing a way to define
new binary and unary operators which during expansion can manipulate
their operators. However, those operators must be fully expanded and
must match as an expression.

Sweet.js provides \emph{infix macros} which allows a macro identifier to
match syntax before it. For example, the following implements
ES6-style arrow functions via infix macros:

\begin{verbatim}
macro (=>) {
    rule infix {
        ($params ...) | { $body ... }
    } => {
        function ($params ...) {
            $body ...
        }
    }
}

var id = (x) => { return x; }
\end{verbatim}

TODO: details and limitations\ldots{}
\subsection{Invoke and Pattern Classes}
\label{sec-4-2}

TODO: motivation and details\ldots{}

\section{Hygiene}
\label{sec-5}

Mostly straightforward implementation from scheme with some details to
handle \texttt{var}.
\section{Implementation}
\label{sec-6}
Sweet.js is written in JavaScript and runs in the major JS
environments (\ie the brower and node.js). This is in contrast to Honu
which translates its code to Racket code and reuses the hygienic
expansion machinery already built in Racket. While this simplifies
the implementation of Honu it also requires an installation of Racket
which in some cases is not feasible (\eg sweet.js is able to run in
mobile device browsers).
\section{Related Work}
\label{sec-7}

\begin{itemize}
\item Scheme/Racket
\item Honu
\item Template Haskell
\item Nemerle
\item Scala
\item Closure
\end{itemize}
\section{Conclusion}
\label{sec-8}
% Emacs 24.3.1 (Org mode 8.2.5h)
\end{document}